26 Hole Ball/26/pickleball_26_ws13.0/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       126535;
    }
    outlet
    {
        type            patch;
        nFaces          719;
        startFace       126735;
    }
    ground
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2314;
        startFace       127454;
    }
    frontAndBack
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          1861;
        startFace       129768;
    }
    buildings
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5635;
        startFace       131629;
    }
)

// ************************************************************************* //
